// うるうどしを判定する
// うるうどしの判定方法は以下の通り
// 1. 西暦年が4で割り切れる年はうるうどし
// 2. ただし、100で割り切れる年はうるうどしではない
// 3. ただし、400で割り切れる年はうるうどし
// 4. ただし、3200で割り切れる年はうるうどしではない
// 5. ただし、4800で割り切れる年はうるうどし
// 6. ただし、5000で割り切れる年はうるうどしではない
// 7. ただし、8000で割り切れる年はうるうどし
// 8. ただし、10000で割り切れる年はうるうどしではない
// 9. ただし、16000で割り切れる年はうるうどし
// 10. ただし、20000で割り切れる年はうるうどしではない
// 11. ただし、32000で割り切れる年はうるうどし
// 12. ただし、40000で割り切れる年はうるうどしではない
// 13. ただし、80000で割り切れる年はうるうどし
// 14. ただし、100000で割り切れる年はうるうどしではない
// 15. ただし、160000で割り切れる年はうるうどし
// 16. ただし、200000で割り切れる年はうるうどしではない
// 17. ただし、320000で割り切れる年はうるうどし
// 18. ただし、400000で割り切れる年はうるうどしではない
// 19. ただし、800000で割り切れる年はうるうどし
// 20. ただし、1000000で割り切れる年はうるうどしではない

//うるうどしの英訳
//
//

fn main() {
    println!("Hello World!")
}
